Revit 2027 API
BRepBuilder.IsValidFaceId Method
 A validator function that checks whether the face id corresponds to a face previously added to this BRepBuilder object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidFaceId(
	BRepBuilderGeometryId faceId
)
Public Function IsValidFaceId (
	faceId As BRepBuilderGeometryId
) As Boolean
public:
bool IsValidFaceId(
	BRepBuilderGeometryId^ faceId
)
member IsValidFaceId :
        faceId : BRepBuilderGeometryId -> bool
Parameters
faceId BRepBuilderGeometryId
 Face id to be validated.
Return Value
Boolean
 True if faceId corresponds to a face previously added to this BRepBuilder, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BRepBuilder Class
Autodesk.Revit.DB Namespace